tutorials/pimpleHFDIBFoam/Patient_template_UpdatedValves_14Oct/0/f
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2412                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      f;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// HFDIB usually uses acceleration units for f 
dimensions      [0 1 -2 0 0 0 0];     // m s^-2
internalField   uniform (0 0 0);

boundaryField
{
    INLET
    {
        type    fixedValue;
        value   uniform (0 0 0);
    }
    OUTLET
    {
        type    fixedValue;
        value   uniform (0 0 0);
    }
    WALL
    {
        type    fixedValue;
        value   uniform (0 0 0);
    }
    // TOP
    // {
    //     type    fixedValue;
    //     value   uniform (0 0 0);
    // }
}

// ************************************************************************* //
