tutorials/pimpleHFDIBFoam/Patient_template_UpdatedValves_14Oct/constant/HFDIBDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  3.0.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      HFDIBDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


bodyList ("mitralValve" "aorticValve");

interpolationSchemes
{
    U cellPointFace;
}

mitralValve
{
    // The immersed geometry (inner surface is used to detect the axis & caps)
    fileName  MV_Valve_Final.stl;

   // --- New mitral slice-axis law (auto Ct/Cb from inner surface) ---
    deformingBody_mitral
    {
      fixedEnd top;
        // Time profile: peak closure at T/2 with cos^2 shape
      period     1.0;
      timeLaw    twoWindow;

      // close window [t0, t1], open window [t2, t3] in seconds (periodic)
      closeWindow (0.615 0.645);
      //closeWindow (0.005 0.035);
      openWindow  (0.950 1.000);
      //openWindow  (0.065 0.115);

      Fmax       0.7;
      nearRamp   0.004;
      activeLen  0.016;
      spaceLaw   smootherstep;

      topCenter    (0.03207349  0.01807158 -0.01916943);
      bottomCenter (0.03422381  0.00254167 -0.01892332);

      leafThickness 0.001;         // optional; stays inactive unless you pair skins

        // Help pick the correct “TOP” cap orientation using the same STL
        flipNormalTowardValve true;
        valveRefFile  "constant/triSurface/MV_Valve_Final.stl";

        // (Intentionally NOT setting topCenter/bottomCenter → auto-detect)
    }

    // Solid density for coupling/inertia (kept from your setup)
    rho         rho [1 -3 0 0 0 0 0] 5000;

    // Surface MC refinement for body fraction near the interface
    refineMC    6;

    // Imposed field BC used by HFDIB (velocity stencil side)
    U
    {
        BC noSlip;
    }
}
// ************************************************************************* //


aorticValve
{
    // The immersed geometry (inner surface is used to detect the axis & caps)
    fileName  AV_Valve_Final.stl;

   // --- New mitral slice-axis law (auto Ct/Cb from inner surface) ---
    deformingBody_mitral
    {
      fixedEnd bottom;
        // Time profile: peak closure at T/2 with cos^2 shape
      period     1.0;
      timeLaw    threeWindow;

      // close window [t0, t1], open window [t2, t3] in seconds (periodic)
      close1Window   (0.000 0.01);   // initial close (open→closed)
      openWindow     (0.645 0.675);   // open   (closed→open)
      //openWindow     (0.035 0.065);
      close2Window   (0.950 1.000);   // final  (open→closed)
      // close2Window   (0.065 0.115);

      Fmax       0.7;
      nearRamp   0.004;
      activeLen  0.016;
      spaceLaw   smootherstep;

      topCenter    (0.00814969  0.02723242 -0.01885306);
      bottomCenter (0.01545705  0.01562264 -0.01909322);

      leafThickness 0.001;         // optional; stays inactive unless you pair skins

        // Help pick the correct “TOP” cap orientation using the same STL
        flipNormalTowardValve true;
        valveRefFile  "constant/triSurface/AV_Valve_Final.stl";

        // (Intentionally NOT setting topCenter/bottomCenter → auto-detect)
    }

    // Solid density for coupling/inertia (kept from your setup)
    rho         rho [1 -3 0 0 0 0 0] 5000;

    // Surface MC refinement for body fraction near the interface
    refineMC    6;

    // Imposed field BC used by HFDIB (velocity stencil side)
    U
    {
        BC noSlip;
    }
}
// ************************************************************************* //

// ************************************************************************* //
